dada561431/-/PSOC_Edge_Hachimitsu_Detector/proj_cm55/lv_port_disp.c
/*******************************************************************************
* File Name        : lv_port_disp.c
*
* Description      : This file provides implementation of low level display
*                    device driver for LVGL.
*
* Related Document : See README.md
*
********************************************************************************
* (c) 2025-2026, Infineon Technologies AG, or an affiliate of Infineon
* Technologies AG. All rights reserved.
* This software, associated documentation and materials ("Software") is
* owned by Infineon Technologies AG or one of its affiliates ("Infineon")
* and is protected by and subject to worldwide patent protection, worldwide
* copyright laws, and international treaty provisions. Therefore, you may use
* this Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software. If no license
* agreement applies, then any use, reproduction, modification, translation, or
* compilation of this Software is prohibited without the express written
* permission of Infineon.
*
* Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
* IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
* INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
* THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
* SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
* Infineon reserves the right to make changes to the Software without notice.
* You are responsible for properly designing, programming, and testing the
* functionality and safety of your intended application of the Software, as
* well as complying with any legal requirements related to its use. Infineon
* does not guarantee that the Software will be free from intrusion, data theft
* or loss, or other breaches ("Security Breaches"), and Infineon shall have
* no liability arising out of any Security Breaches. Unless otherwise
* explicitly approved by Infineon, the Software may not be used in any
* application where a failure of the Product or any consequences of the use
* thereof can reasonably be expected to result in personal injury.
*******************************************************************************/

/*******************************************************************************
* Header Files
*******************************************************************************/
#include "lv_port_disp.h"
#include "lv_draw_sw.h"
#include <stdbool.h>
#include <string.h>
#include "cy_graphics.h"


#if LV_COLOR_DEPTH == 16
    #define BYTE_PER_PIXEL (LV_COLOR_FORMAT_GET_SIZE(LV_COLOR_FORMAT_RGB565)) 
    #define DISP_COLOR_FORMAT (LV_COLOR_FORMAT_RGB565)
#elif LV_COLOR_DEPTH == 32
    #define BYTE_PER_PIXEL (LV_COLOR_FORMAT_GET_SIZE(LV_COLOR_FORMAT_ARGB8888))
    #define DISP_COLOR_FORMAT (LV_COLOR_FORMAT_ARGB8888)
#endif

#define DISP_DRAW_BUFFER_LINES (40U)


/*******************************************************************************
* Global Variables
*******************************************************************************/
CY_SECTION(".cy_gpu_buf") LV_ATTRIBUTE_MEM_ALIGN uint8_t disp_frame_buf[MY_DISP_HOR_RES *
                                                  MY_DISP_VER_RES * BYTE_PER_PIXEL];
CY_SECTION(".cy_gpu_buf") LV_ATTRIBUTE_MEM_ALIGN uint8_t disp_draw_buf[MY_DISP_HOR_RES *
                                                 DISP_DRAW_BUFFER_LINES * BYTE_PER_PIXEL];
/* Frame buffers used by GFXSS to render UI */
void *frame_buffer1 = &disp_frame_buf;
void *frame_buffer2 = NULL;

cy_stc_gfx_context_t gfx_context;


/*******************************************************************************
* Function Name: disp_flush
********************************************************************************
* Summary:
*  Flush the content of the internal buffer the specific area on the display.
*  You can use DMA or any hardware acceleration to do this operation in the
*  background but 'lv_disp_flush_ready()' has to be called when finished.
*
* Parameters:
*  *disp_drv: Pointer to the display driver structure to be registered by HAL.
*  *area: Pointer to the area of the screen (not used).
*  *color_p: Pointer to the frame buffer address.
*
* Return:
*  void
*
*******************************************************************************/
static void LV_ATTRIBUTE_FAST_MEM disp_flush(lv_display_t *disp_drv,
                                             const lv_area_t *area,
                                             uint8_t *color_p)
{
    int32_t copy_w;
    int32_t copy_h;
    uint32_t src_stride;
    uint32_t dst_stride;
    uint8_t *dst;

    copy_w = lv_area_get_width(area);
    copy_h = lv_area_get_height(area);
    if ((copy_w <= 0) || (copy_h <= 0))
    {
        lv_display_flush_ready(disp_drv);
        return;
    }

    src_stride = lv_draw_buf_width_to_stride((uint32_t)copy_w, DISP_COLOR_FORMAT);
    dst_stride = lv_draw_buf_width_to_stride(MY_DISP_HOR_RES, DISP_COLOR_FORMAT);
    dst = ((uint8_t *)frame_buffer1) +
          ((uint32_t)area->y1 * dst_stride) +
          ((uint32_t)area->x1 * BYTE_PER_PIXEL);

    for (int32_t y = 0; y < copy_h; y++)
    {
        memcpy(dst + ((uint32_t)y * dst_stride),
               color_p + ((uint32_t)y * src_stride),
               src_stride);
    }

    Cy_GFXSS_Set_FrameBuffer((GFXSS_Type*) GFXSS, (uint32_t*) frame_buffer1,
            &gfx_context);

    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY))
    {
        /* Inform the graphics library that you are ready with the flushing */
        lv_display_flush_ready(disp_drv);
    }

}


/*******************************************************************************
* Function Name: lv_port_disp_init
********************************************************************************
* Summary:
*  Initialization function for display devices supported by LittelvGL.
*   LVGL requires a buffer where it internally draws the widgets.
*   Later this buffer will passed to your display driver's `flush_cb` to copy
*   its content to your display.
*   The buffer has to be greater than 1 display row
*
*   There are 3 buffering configurations:
*   1. Create ONE buffer:
*      LVGL will draw the display's content here and writes it to your display
*
*   2. Create TWO buffer:
*      LVGL will draw the display's content to a buffer and writes it your
*      display.
*      You should use DMA to write the buffer's content to the display.
*      It will enable LVGL to draw the next part of the screen to the other
*      buffer while the data is being sent form the first buffer.
*      It makes rendering and flushing parallel.
*
*   3. Double buffering
*      Set 2 screens sized buffers and set disp_drv.full_refresh = 1.
*      This way LVGL will always provide the whole rendered screen in `flush_cb`
*      and you only need to change the frame buffer's address.
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void lv_port_disp_init(void)
{
    memset(disp_frame_buf, 0, sizeof(disp_frame_buf));
    memset(disp_draw_buf, 0, sizeof(disp_draw_buf));

    lv_display_t * disp = lv_display_create(MY_DISP_HOR_RES, MY_DISP_VER_RES);

    lv_display_set_flush_cb(disp, disp_flush);

    lv_tick_set_cb(xTaskGetTickCount);

    lv_display_set_buffers(disp, disp_draw_buf, NULL, sizeof(disp_draw_buf),
                           LV_DISPLAY_RENDER_MODE_PARTIAL);

    /* Set the display resolution to match the physical resolution so that
     * LVGL renders the UI within the limits of the actual display resolution.
     */
    lv_display_set_resolution(disp, ACTUAL_DISP_HOR_RES, ACTUAL_DISP_VER_RES);

    Cy_GFXSS_Clear_DC_Interrupt((GFXSS_Type*) GFXSS, &gfx_context);
}


/* [] END OF FILE */
